from django.shortcuts import render,HttpResponse

# Create your views here.

def home(request):
    return render(request,"news_app/home.html")

def music(request):
      news_music = [
        {"number":"1","title":"دبیر هفدهمین جشنواره موسیقی جوان منصوب شد","text":"به گزارش خبرگزاری مهر به نقل از روابط عمومی معاونت امورهنری، محمود سالاری معاون هنری وزارت فرهنگ و ارشاد اسلامی، با حضور محمد اله‌یاری مدیر دفتر موسیقی و سید امیرعباس ستایشگر مدیر انجمن موسیقی، حمیدرضا اردلان را به عنوان دبیر هفدهمین جشنواره موسیقی جوان منصوب و حکم وی را به او اهدا کرد."},
        {"number":"2","title":"جزییاتی از ساخت موسیقی «عشق کوفی»/ این ملودی ها متفاوت است!","text":"مسعود سخاوت دوست آهنگساز سریال «عشق کوفی» که این روزها از آنتن شبکه سوم سیما پیش روی مخاطبان قرار گرفته، در گفتگو با خبرنگار مهر درباره نحوه ساخت موسیقی متن این سریال مناسبتی ویژه ایام سوگواری شهادت حضرت سیدالشهدا (ع) گفت: آنچه برای ساخت و اتمسفر موسیقی متن این سریال در نظر گرفته شده تمرکزروی دو بخش محتوای اثر بوده است. اولی بخش جغرافیایی سریال است که تلاش شده محتوای موسیقایی در تشخص جغرافیا و فرهنگ مردمان عرب زبان به ویژه منطقه شامات و کوفه طراحی شود. دومین بخش هم مبتنی بر فضای عمومی کاراست که این مسیر منطبق بر موسیقی جهان و فضای کلاسیک سریال هاست و من تلاش کردم در این قالب هم فضای آهنگسازی سریال را طراحی کنم"},
        {"number":"3","title":"ناصر فرهنگ فر","text":"به گزارش ایسنا، ‌ ۲۳ مردادماه سالروز درگذشت نوازنده برجسته تنبک و مدرس موسیقی سنتی ایرانی یعنی زنده‌یاد ناصر فرهنگ‌فر است که ‌پس از یک دوره کناره‌گیری و انزوای کاری در روز پنجشنبه ۲۳ مرداد ۱۳۷۶ در ۴۹ سالگی چشم از جهان فروبست."},
        {"number":"4","title":" کنسرت های علیرضا قربانی","text":"علیرضا قربانی رکوردشکن برگزاری کنسرت در چهار ماه اخیر است.با نگاهی به وضعیت کنسرت‌ها در چهار ماهه ابتدایی سال و پیش از شروع محرم به این نتیجه رسیدیم که بزرگترین برگزار کننده کنسرت که رکورد شکن هم بوده، علیرضا قربانی است."},
        {"number":"5","title":"رضا صادقی:من امام حسینی ام","text":"رضا صادقی» با به اشتراک گذاشتن استوری در فضای مجازی نوشت: ترجیح میدهم در ایام دهه محرم خیلی استوری نگاه نکنم چون دلم نمیخواد نسبت به کسایی که دوستشون دارم دل چرکین بشم.به گزارش خبرنگار گروه فرهنگ و هنر برنا؛ «رضا صادقی» خواننده‌ی پاپ کشور با به اشتراک گذاشتن استوری در آستانه‌ی ماه محرم در فضای مجازی نوشت: «من ترجیح میدم در ایام دهه محرم خیلی استوری نگاه نکنم چون دلم نمیخواد نسبت به کسایی که دوستشون دارم دل  چرکین بشم."},
    ]
      return render(request,"news_app/news.html",context={"music": news_music})
     
         
   
    
    
   
    
